<template>
  <div v-if="value" v-dom-portal>
    <div class="protocol-box">
      <span class="close-btn" @click="$emit('input', false)"></span>
      <p>注册协议</p>
      <div class="protocol-scroller--wrapper" id="protocol-scroller--wrapper">
        <div class="protocol-scroller-box" :class="'status' + status">
          <div>
            <scroller style="height: 100%">
              <div class="pro-title">一、实名授权</div>
              <div class="protocol-content">
                <p>您同意并授权网银在线（北京）科技有限公司收集、存储您填写的个人信息，并通过合作银行和其他第三方进行身份验证及数据校验。实名认证后您可以享受京东提供的相关产品或服务。</p>
                <!--<p>【审慎阅读】您在点击同意前，<a class="adecoration bold dark"> 请您务必审慎阅读、充分理解协议中相关条款内容，其中包括：</a></p>-->
                <!--<p>-->
                <!--<a class="adecoration bold dark">1、与您约定免除或限制责任的条款;</a> <br><a class="adecoration bold dark">2、与您约定法律适用和管辖的条款;</a> <br/><a class="adecoration bold dark">3、其他以粗体下划线标识的重要条款。</a><br/>如您对协议有任何疑问，可向本公司客服咨询。-->
                <!--</p>                -->
                <!--<p>【特别提示】<a class="adecoration bold dark">您通过网络页面点击确认或以其他方式（包括但不限于签字或签章确认等方式）接受本协议，即表示您与网银在线（北京）科技有限公司已达成协议并同意接受本协议的全部约定内容。</a>在接受本协议之前，请您仔细阅读本协议的全部内容（特别是以<a class="adecoration bold dark">粗体下划线</a>标注的内容）。<a class="adecoration bold dark">如您不同意接受本协议的任意内容，或者无法准确理解相关条款含义的，请不要进行后续操作。</a><span>如果您对本协议的条款有疑问的，请通过本公司客服渠道进行询问（客服电话：95118），本公司将向您解释条款内容。</span>-->
                <!--</p>-->
                <!--<p><a class="bold dark">一、概述</a></p>-->
                <!--<p>快捷支付服务协议（以下简称本协议）是网银在线（北京）科技有限公司（以下简称本公司）与您就快捷支付服务所订立的有效合约。</p>-->
                <!--<p><a class="bold dark">二、双方权利义务</a></p>-->
                <!--<p>1、您应确保您是使用本服务的银行卡持有人，可合法、有效使用该银行卡且未侵犯任何第三方合法权益，否则因此造成本公司、持卡人损失的，您应负责赔偿并承担全部法律责任，包括但不限于<a class="adecoration bold dark">对您的京东钱包账户中的余额进行止付、终止或中止为您提供京东钱包服务，从您的前述京东钱包账户中扣除相应的款项等。</a></p>-->
                <!--<p><a class="adecoration bold dark">2、您应确保开通本服务所提供的手机号码为本人所有，并授权本公司可以通过第三方渠道对您所提供手机号码的真实性、有效性进行核实。</a></p>-->
                <!--<p><a class="adecoration bold dark">3、您同意本公司有权依据其自身判断对涉嫌欺诈或被他人控制并用于欺诈目的的京东钱包账户采取相应的措施，上述措施包括但不限于对您的京东钱包账户中的余额进行止付、终止或中止为您提供京东钱包服务、处置涉嫌欺诈的资金等。</a></p>-->
                <!--<p><a class="adecoration bold dark">4、您应妥善保管银行卡、卡号、有效日期、卡背后三位数字、密码、发卡行预留的手机号码以及京东钱包账号、密码、数字证书、手机动态口令、京东钱包账户绑定的手机号码、来自于发卡行和/或本公司向您发送的校验码等与银行卡或与京东钱包账户有关的一切信息和设备。如您遗失或泄露前述信息和/或设备的，您应及时通知发卡行及/或本公司，以减少可能发生的损失。无论是否已通知发卡行及/或本公司，因您的原因所致损失需由您自行承担。</a></p>-->
                <!--<p>5、您在使用本服务时，应当认真确认交易信息，包括且不限于商品名称、数量、金额等，并按本公司业务流程发出符合《京东钱包服务协议》约定的指令。<a class="adecoration bold dark">您认可和同意：您发出的指令不可撤回或撤销，本公司一旦根据您的指令委托银行或第三方从银行卡中划扣资金给收款人，您不应以非本人意愿交易或其他任何原因要求本公司退款或承担其他责任。</a></p>-->
                <!--<p>6、在对使用本服务过程中发出指令的真实性及有效性承担全部责任；您承诺，本公司依照您的指令进行操作的一切风险由您承担。</p>-->
                <!--<p><a class="adecoration bold dark">7、您认可京东钱包账户的使用记录数据、交易金额数据等均以本公司系统平台记录的数据为准。</a></p>-->
                <!--<p>8、您同意本公司有权留存您在本公司网站填写的相应信息，并授权本公司查询该银行卡信息，包括且不限于借记卡余额、信用卡账单等内容，以供后续向您持续性地提供相应服务（包括但不限于将本信息用于向您推广、提供其他更加优质的产品或服务）。</p>-->
                <!--<p><a class="adecoration bold dark">9、出现下列情况之一的，本公司有权立即终止您使用本公司相关服务而无需承担任何责任：（1）将本服务用于非法目的；（2）违反本协议的约定；（3）违反本公司及/或本公司关联公司及/或京东集团旗下其他公司网站的条款、协议、规则、通告等相关规定及您与前述主体签署的任一协议，而被上述任一主体终止提供服务的；（4）本公司认为向您提供本服务存在风险的；（5）您的银行卡无效、有效期届满或注销（如有）。</a></p>-->
                <!--<p><a class="adecoration bold dark">10、若您未违反《京东钱包服务协议》及本协议约定且因不能归责于您的原因，造成银行卡内资金通过本服务出现损失，且您未从中获益的，您可向本公司申请补偿。您应在知悉资金发生损失后及时通知本公司并按要求提交相关的申请材料和证明文件，本公司将通过自行补偿或保险公司赔偿的方式处理您的申请。具体处理方式由本公司自行选择决定，本公司承诺不会因此损害您的合法权益。如本公司选择保险赔偿的方式，您同意委托本公司为您向保险公司索赔，并且您承诺：资金损失事实真实存在，保险赔偿申请材料真实、有效。您已充分知晓并认识到，基于虚假信息申请保险赔偿将涉及刑事犯罪，保险公司与本公司有权向国家有关机构申请刑事立案侦查。</a></p>-->
                <!--<p><a class="adecoration bold dark">11、不论本公司选择何种方式保障您使用本服务的资金安全，您同意并认可本公司最终的补偿行为或保险赔偿行为并不代表前述资金损失应归责于本公司，亦不代表本公司须为此承担其他任何责任。您同意，本公司在向您支付补偿的同时，即刻取得您可能或确实存在的就前述资金损失而产生的对第三方的所有债权及其他权利，包括但不限于就上述债权向第三方追偿的权利，且您不再就上述已经让渡给本公司的债权向该第三方主张任何权利，亦不再就资金损失向本公司主张任何权利。</a></p>-->
                <!--<p><a class="adecoration bold dark">12、若您又从其它渠道挽回了资金损失的，或有新证据证明您涉嫌欺诈的，或者发生您应当自行承担责任的其他情形，您应在第一时间通知本公司并将返还本公司已补偿或保险公司已赔偿的款项，否则本公司有权自行或根据保险公司委托采取包括但不限于从您全部或部分本公司账户（含该账户之关联账户）划扣等方式向您进行追偿。</a></p>-->
                <!--<p><a class="bold dark">三、授权与承诺</a></p>-->
                <!--<p><a class="adecoration bold dark">1、您保证使用本服务过程中提供的信息真实、准确、完整、有效，您为了使用本服务向本公司提供的所有信息，如姓名、身份证号、银行卡卡号及预留手机号，将全部成为您京东钱包账户信息的一部分。本公司按照您设置的相关信息为您提供相应服务，对于因您提供信息不真实或不完整所造成的损失由您自行承担。</a></p>-->
                <!--<p><a class="adecoration bold dark">2、您授权本公司在您使用本服务期间或本服务终止后，基于为更好的向您提供服务之目的或向您推广其他产品/服务的需要，有权保留并使用您在使用本服务期间所形成的相关信息数据，包括但不限于提供给本公司之关联公司和京东集团旗下公司该等信息。同时该授权不可撤销。</a></p>-->
                <!--<p><a class="bold dark">四、协议的修改</a></p>-->
                <!--<p>您同意，本公司有权随时对本协议内容进行单方面的变更，并以在www.jdpay.com网站公告的方式提前予以公布，无需另行单独通知您；若您在本协议内容公告变更生效后继续使用本服务的，表示您已充分阅读、理解并接受变更修改后的协议内容，也将遵循变更修改后的协议内容使用本服务；若您不同意变更修改后的协议内容，您应在变更生效前停止使用本服务。</p>-->
                <!--<p><a class="bold dark">五、法律适用和管辖</a></p>-->
                <!--<p>1、您同意，本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，没有相关法律规定的，参照通用国际商业惯例和（或）行业惯例。</p>-->
                <!--<p><a class="adecoration bold dark">2、您同意，因本协议产生之争议，双方应努力友好协商解决。如协商不成，本公司和您同意由本公司所在地法院管辖审理双方的纠纷或争议。</a></p>-->
                <!--<p><a class="bold dark">六、其他</a></p>-->
                <!--<p>1、本协议部分内容被有管辖权的法院认定为违法或无效的，不因此影响其他内容的效力。</p>-->
                <!--<p>2、本协议属于《京东钱包服务协议》不可分割的一部分。本协议与《京东钱包服务协议》的约定不一致的，以本协议为准；本协议未约定事宜，均以本公司不时公布的《京东钱包服务协议》及相关附属规则为补充。</p>-->
              </div>
            </scroller>
          </div>
          <div>
            <scroller style="height: 100%">
              <div class="pro-title">二、用户注册及绑定授权协议</div>
              <div class="protocol-content">
                <p>协议签署提示</p>
                <p><a class="adecoration bold dark">《京东钱包服务协议》、《快捷登录服务协议》被放置在同一文档中进行签约的目的在于尽可能减少协议展示所占用的系统空间，这种协议展现形式并不影响您签约后根据不同协议所享有的权利及需要履行的义务，您对此不持异议。</a>
                </p>
                <p>快捷登录服务协议</p>
                <p><a class="bold">第一条 概述</a></p>
                <p>
                  1、快捷登录服务协议（以下简称“本协议”）是网银在线（北京）科技有限公司（以下简称“本公司”或“网银在线”）与网银在线用户（以下简称“用户”或“您”)就快捷登录服务（以下简称“本服务”）的使用等相关事项所订立的有效合约。您通过网络页面点击确认或以其他方式选择接受本协议，即表示您与本公司已达成协议并同意接受本协议的全部约定内容。</p>
                <p>2、如果您对本协议的条款有疑问，请通过本公司客服渠道进行咨询，本公司将向您解释条款内容。如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作。</p>
                <p>3、本协议已对与您的权益有或可能具有重大关系的条款，及对本公司具有或可能具有免责或限制责任的条款<a class="adecoration bold dark">以粗体下划线</a>予以标注，请您注意。您确认，您在接受本协议之前，您已充分阅读、理解并接受本协议的全部内容，一旦您使用本服务，即表示您同意遵循本协议之所有约定。
                </p>
                <p><a class="bold">第二条 定义</a></p>
                <p>快捷登录服务：您可以通过本服务实现京东钱包账户与第三方网站或应用的账户的绑定关系的服务。本协议中的“第三方”若无特别说明，均指运营您通过本服务登录的具体网站、应用或服务等的个人、法人或其他组织。</p>
                <p><a class="bold">第三条 账号绑定后实现的功能</a></p>
                <p>第三方账户、京东钱包账户绑定后，我们将帮您实现以下功能：</p>
                <p>(1)第三方账号登录状态下，您可以使用已登录的第三方账户直接登录京东钱包账户；</p>
                <p>(2)第三方帐号登录状态下，可免登跳转到京东钱包网站，或直接启用本公司提供的各种业务服务，例如使用京东钱包服务进行付款等；</p>
                <p>(3)产品升级后的其他功能。</p>
                <p><a class="bold">目前，每个京东钱包帐号只能绑定一个第三方帐号。</a></p>
                <p><a class="bold">第四条 特别授权</a></p>
                <p><a class="adecoration bold dark">为实现账户绑定，您同意并授权第三方通过技术方式实现如下操作，本公司会要求该第三方依法使用您的上述信息，并应对您的信息保密：</a>
                </p>
                <p><a class="adecoration bold dark">(1)第三方将您填写、提交的个人信息提供给本公司，您同意并授权本公司收集、存储您填写、提交的个人信息，并通过合作银行和其他第三方进行身份验证及数据校验，实名认证后您可以享受京东提供的相关产品或服务；</a>
                </p>
                <p><a class="adecoration bold dark">(2)第三方将获取您的京东钱包账户的相关信息（包括京东钱包登录名、京东钱包账户头像、京东钱包账户昵称等相关信息）；</a></p>
                <p><a class="adecoration bold dark">(3) 本公司将获取您的第三方账户的信息（包括第三方会员名、交易信息等）。</a></p>
                <p><a class="bold">第五条 账户绑定解除</a></p>
                <p>1、除本协议另有约定外，本服务暂不支持线上账号解绑，您可通过本公司客服渠道进行咨询。</p>
                <p>2、在以下情形下您的账号绑定关系将被解除：</p>
                <p>(1)、因账户安全等安全因素考虑，本公司强制解除您账户绑定关系；</p>
                <p>(2)、建立绑定关系的两个账户中，任一方账户注销成功，绑定关系将自动解除；</p>
                <p>(3)、用户违反国家法律法规或政策的；</p>
                <p>(4)、用户违反本协议、《京东钱包服务协议》、第三方网站/应用/服务的用户服务协议或其相关规定的；</p>
                <p>(5)、其他特殊情况需要解除绑定的。</p>
                <p><a class="bold">第六条 隐私保护</a></p>
                <p>1、如用户发现其京东钱包帐户遭他人非法访问或使用，应立即通知本公司。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，本公司不承担任何责任。</p>
                <p>2、本公司不会将您的信息挪作他用。</p>
                <p>3、本公司不对外公开或向第三方提供单个用户的注册资料，除非：</p>
                <p>(1)事先获得用户的明确授权；</p>
                <p>(2)只有透露你的个人资料，才能提供你所要求的产品和服务；</p>
                <p>(3)根据有关的法律法规要求；</p>
                <p>(4)按照相关政府主管部门的要求；</p>
                <p>(5)为维护本公司的合法权益。</p>
                <p><a class="bold">第七条 免责</a></p>
                <p>
                  1、本公司有义务在技术上确保本服务的有效、正常运行，保证您的正常使用。同时本公司有权根据自身业务的发展，增加、减少或撤销相关本服务内容，调整本服务内容及方式或者对本服务功能进行升级、维护和改造的权利。如您不接受上述变更的，您应立即停止使用本服务并终止本协议。一旦您继续使用本服务的，即视为您同意接受相应的变更或调整。</p>
                <p><a class="adecoration bold dark">2、除本协议另有规定外，本公司在提前邮件通知您或在网站公告的情况下，可以单方面终止向您提供本服务，并不承担任何赔偿责任。本公司在终止提供本服务后，若发现您之前存在违法或违反本协议目的的使用行为，给本公司造成损失的，则本公司仍可据此要求您承担相应赔偿责任并保留通过司法途径予以解决的权利。</a>
                </p>
                <p><a
                  class="adecoration bold dark">3、您理解并确认，因本公司业务发展或与第三方的合作关系中止或终止等原因，可能导致本公司无法继续向您提供本服务，对此本公司不承担违约责任。</a>
                </p>
                <p><a class="adecoration bold dark">4、本公司获取的您的信息来自第三方，本公司仅对获取的信息进行展示，如您对展示的信息内容有疑问的，请联系第三方，并以第三方告知的信息内容为准。本公司不保证信息的真实性、完整性、准确性、及时性，如您因使用展示的信息而导致了任何损失，本公司不承担责任。</a>
                </p>
                <p><a class="adecoration bold dark">5、本公司无法保证第三方网站、应用或服务等的合法性、安全性以及真实性，第三方网站、应用或服务等的质量和安全等由第三方独立负责、承担，您会自行进行判断、甄别、选择。若您因登录、使用第三方网站、应用或服务等产生任何纠纷或损失的，您应自行与第三方协商或通过其他合法途径解决，本公司无需对此向您承担任何责任或赔偿您任何损失。</a>
                </p>
                <p><a class="bold">第八条 协议修改</a></p>
                <p>1、本公司将有权随时修改本协议的有关条款，一旦相关内容发生变动，本公司公司将会通过电子邮件或网站公告等方式向您提示修改内容。</p>
                <p>
                  2、如果您不同意本公司对本协议相关条款所做的修改或者本公司不时公布的《京东钱包服务协议》及相关附属规则，您应立即停止使用本公司提供的本项服务。如果您继续使用本公司提供的服务，则视为您接受并认可本协议相关条款的修改及本公司不时公布的《京东钱包服务协议》及相关附属规则。</p>
                <p><a class="bold">第九条 争议的解决</a></p>
                <p><a class="adecoration bold dark">双方在履行本协议的过程中，如发生争议，应协商解决。协商不成的，任何一方均可向本公司所在地有管辖权的人民法院提起诉讼。</a></p>
                <p><a class="bold">第十条 协议的解释</a></p>
                <p>本协议的成立、生效、履行和解释，均适用中华人民共和国法律。本服务协议未规定部分依照《京东钱包服务协议》及相关附属规则予以履行；本协议与《京东钱包服务协议》及相关附属规则不一致的，以本协议为准。</p>
              </div>
            </scroller>
          </div>
          <div>
            <scroller style="height: 100%">
              <div class="pro-title">三、京东钱包服务协议</div>
              <div class="protocol-content">
                <p><a class="bold">一、协议的确认</a></p>
                <p>1、本协议有助于您了解本公司为您提供的服务内容及您使用服务的权利和义务，请您务必审慎阅读、充分理解协议中相关条款内容（特别是以<a
                  class="adecoration bold dark">粗体下划线</a>标注的内容）。如果您对本协议的条款有疑问，您可通过本公司客服渠道（客服电话：95118）进行咨询。</p>
                <p><a class="bold">2、如本协议发生变更，本公司将通过www.jdpay.com网站公告的方式提前予以公布，变更后的协议在公告期届满起生效。若您在协议生效后继续使用京东钱包服务的，表示您接受变更后的协议，也将遵循变更后的协议使用京东钱包服务。</a>
                </p>
                <p>
                  3、如您为无民事行为能力人或为限制民事行为能力人，请告知您的监护人，并在您监护人的指导下阅读本协议和使用京东钱包服务。若您非自然人，则您确认，您订立并履行本协议不受您所属、所居住或开展经营活动或其他业务的国家或地区法律法规的限制。</p>
                <p><a class="bold">二、相关定义</a></p>
                <p>
                  1、京东钱包会员号（或称“会员号”）：指您按照本公司提供的方式取得的，供您使用部分京东钱包服务的编号。会员号登录名可以是您的电子邮箱，也可以是您的手机号码。如您只持有会员号，则不能使用余额服务（见下文定义）。</p>
                <p>
                  2、京东钱包账户（或称“账户”）：指您获得京东钱包会员号且通过本公司身份验证后，由您申请并确认取得的供您使用京东钱包服务的支付账户。您取得京东钱包账户后，会员号登录名即成为您京东钱包账户登录名。除本协议另有约定外，京东钱包账户持有人可以使用余额服务。</p>
                <p>3、京东钱包登录名：指您注册京东钱包会员号或京东钱包账户时提供的用于登录的手机号或电子邮箱，分为会员号登录名和账户登录名两种。</p>
                <p>4、身份要素:指本公司用于识别您身份的信息要素，包括但不限于您的会员号、京东钱包账户、密码、数字证书、短信校验码、手机号码、身份证件号码及指纹信息、人脸信息等。</p>
                <p>5、身份要素:指本公司用于识别您身份的信息要素，包括但不限于您的会员号、京东钱包账户、密码、数字证书、短信校验码、手机号码、身份证件号码及指纹信息、人脸信息等。</p>
                <p>
                  6、京东网站：指京东集团旗下任何网站（包括但不限于京东商城网站、京东金融网站、京东到家网站、京东云网站、白条网站及手机京东商城、手机京东金融等各种移动客户端应用程序）与本网站，以及后续可能开通的其他网站及其他移动客户端应用程序，前述网站及客户端可单称或并称京东网站。</p>
                <p>
                  7、京东：指京东商城（域名：jd.com）、京东到家（域名：daojia.jd.com）、京东金融（域名：jr.jd.com）及白条（域名：baitiao.com）、京东云（域名：jcloud.com）等网站及客户端。</p>
                <p>8、有权机关：指依照法律法规等有权要求查询、冻结或扣划资金等措施的单位，包括但不限于公安机关、检察院、法院、海关、税务机关等。</p>
                <p>9、冻结：指有权机关要求的冻结。被冻结余额不能用于支付、提现或转账等，被冻结账户不可登录、使用。</p>
                <p>10、限制：指除冻结情况之外，京东钱包会员号或账户部分或全部功能不能使用，以及会员号或账户相关资产、账户余额、第三方提供的授信额度不能使用。</p>
                <p>11、止付：限制措施的一种，指京东钱包账户余额不能使用，例如不能用于支付、提现或转账等服务。</p>
                <p>12、余额服务：指基于京东钱包账户余额可以使用的充值、消费、收款、转账等服务。余额服务中收付款额度将按照《非银行支付机构网络支付业务管理办法》及其他监管规定。</p>
                <p><a class="bold">三、 服务内容</a></p>
                <p>1、京东钱包服务是本公司向您提供的非金融机构支付服务，是受您委托代您收款或付款的资金转移服务。</p>
                <p>
                  2、通过代收服务，您可以收到他人向您支付的款项，具体是指自您委托本公司将您银行卡内的资金充值到您的京东钱包账户或委托本公司代为收取第三方向您支付的款项之时起至根据您的指令将该等款项的全部或部分实际入账到您的银行账户或京东钱包账户之时止（含提现）的整个过程。
                  通过代付服务，您可以支付款项给您指定的第三方。代付具体是指自款项从您指定账户（非京东钱包账户）出账之时起至本公司根据您或有权方给出的指令将上述款项的全部或部分入账到第三方的银行账户或京东钱包账户之时止的整个过程；或自您委托本公司将您银行卡的资金充值到您或他人的京东钱包账户/自您委托本公司代收相关款项入账到您的京东钱包账户之时起至您委托本公司根据您或有权方给出的指令将上述款项的全部或部分入账第三方的银行账户或京东钱包账户之时止的整个过程。本公司代收代付后，非经法律程序或者非依本协议之约定，该指令是不可撤销的。</p>
                <P>3、代收代付款项服务的功能有如下几类：</P>
                <p>(1)充值，您可以将您银行卡内的资金充值到您的京东钱包账户。</p>
                <p>
                  (2)提现，您可以将您京东钱包账户内余额划转至您名下的可接收款项的中国大陆银行账户。除被冻结、止付或其他限制款项外，本公司将于收到提现指令后的合理时间内，将相应款项汇入该银行账户。此外，我们可能会对提现进行风险审查，因此可能导致提现延。</p>
                <p>(3)转账，您可以使用京东钱包服务，委托本公司将款项转至收款方京东钱包账户或银行账户。<a class="adecoration bold dark">使用转账服务是基于您对收款方的充分了解（包括但不限于收款方的真实身份及准确的京东钱包登录名），请您谨慎核对收款方信息以免受到损失。</a>
                </p>
                <p><a class="bold">四、京东钱包会员号和账户的注册、使用和注销</a></p>
                <p>（一） 注册 </p>
                <p>1、您完成京东钱包会员号注册并激活后，即可使用部分京东钱包服务；您还可以进一步申请并通过本公司验证后取得京东钱包账户，使用更多服务。具体验证方式以本网站页面提示为准。</p>
                <p><a class="adecoration bold dark">2、您在会员号或账户中设置的昵称、头像、签名、留言等必须遵守法律法规、公序良俗、社会公德，且不会侵害其他第三方的合法权益，否则本公司可能会取消您的昵称、头像、签名。</a>
                </p>
                <p>（二） 使用</p>
                <p>身份要素是本公司识别您身份的依据，请您务必妥善保管。<a class="adecoration bold dark">使用身份要素进行的任何操作、发出的任何指令均视为您本人做出。因您的原因造成的账户、密码等信息被冒用、盗用或非法使用，由此引起的相关风险、责任、损失、费用等应由您自行承担。您同意：</a>
                </p>
                <p>1、基于不同的设备终端以及您的使用习惯，我们可能采取不同的验证措施识别您的身份。例如您的京东钱包账户在新设备首次登录的，我们可能通过密码加校验码的方式识别您的身份。</p>
                <p><a class="adecoration bold dark">2、为保障您的资金安全，请把手机及其他设备的密码设置成与京东钱包会员号及账户的密码不一致。如您发现有他人冒用或盗用您的会员号、账户或者京东钱包登录名及密码，或您的手机或其他有关设备丢失时，请您立即以有效方式通知本公司；您还可以向本公司申请暂停或停止京东钱包服务。您理解本公司对您的请求采取行动需要合理时间，如本公司未在合理时间内采取有效措施，导致您损失扩大的，本公司将就扩大的直接经济损失部分承担责任，但本公司对采取行动之前已执行的指令不承担责任。</a>
                </p>
                <p><a class="adecoration bold dark">3、京东钱包会员号和账户仅限您本人使用，不可转让、借用、赠与、继承，但京东钱包账户内的相关财产权益可被依法继承。</a></p>
                <p><a class="adecoration bold dark">4、基于运行和交易安全的需要，本公司可以暂停或者限制京东钱包服务部分功能，或增加新的功能。</a></p>
                <p><a
                  class="adecoration bold dark">5、为了维护良好的网络环境，本公司有时需要了解您使用京东钱包服务的真实背景及目的，如本公司要求您提供相关信息或资料的，请您配合提供。</a>
                </p>
                <p>6、为了您的交易安全，您在使用京东钱包服务时，请事先判断交易对方是否具有完全民事行为能力并谨慎决定是否使用京东钱包服务与对方进行交易</p>
                <p>（三） 注销</p>
                <p>在需要终止使用京东钱包服务时，符合以下条件的，您可以申请注销您的会员号或京东钱包账户</p>
                <p>1、您仅能申请注销您本人的会员号或账户，并依照本公司的流程进行注销。</p>
                <p>2、您可以通过自助或者人工的方式申请注销会员号或账户，但如果您使用了本公司提供的安全产品，请在该安全产品环境下申请注销。</p>
                <p>
                  3、您申请注销的会员号或账户处于正常状态，即您的会员号或账户的信息是最新、完整、正确的，且会员号或账户未被采取止付、冻结等限制措施。如您申请注销的京东钱包账户有关联的京东钱包账户或子京东钱包账户的，在该关联的京东钱包账户或子京东钱包账户被注销后，您才能注销该账户。</p>
                <p>4、为了维护您和其他用户的合法利益，您申请注销的会员号或账户，应当不存在未了结的权利义务或其他因为注销该账户会产生纠纷的情况，不存在任何未完结交易，没有余额，没有关联京东小金库、红包等资产。</p>
                <p><a class="adecoration bold dark">5、为了防止资源占用，如您连续12个月未使用您的京东钱包登录名或本公司认可的其他方式登录过您的会员号或账户，本公司会对该会员号或账户进行注销，您将不能再通过该京东钱包登录名登录本网站或使用相关会员号或者账户。如该会员号或账户有关联的理财产品、待处理交易或余额，本公司会协助您处理，请您按照本公司提示的方式进行操作。</a>
                </p>
                <p><a class="adecoration bold dark">6、如您在任一京东网站有欺诈、发布或销售伪劣商品、侵犯他人合法权益或其他严重违反任一京东网站规则的行为，本公司可以注销您名下的会员号或账户，您将不能再用该会员号或账户的京东钱包登录名登录本网站，所本网站的服务将同时终止。并且本公司会将您违反前述约定的情形同步给其他京东网站。</a>
                </p>
                <p><a class="adecoration bold dark">7、
                  京东钱包会员号或账户注销后，您将无法使用本公司的任何服务，双方的权利义务终止（本协议另有约定不得终止的或依其性质不能终止的除外），同时还可能产生如下结果：</a></p>
                <p><a class="adecoration bold dark">（1）任何兑换代码或卡券（包括但不限于积分、优惠券等任何与会员号或账户关联的兑换代码、卡券）均将作废。</a></p>
                <p><a class="adecoration bold dark">（2）您仍应对您在注销会员号或账户前且使用京东钱包服务期间的行为承担相应责任，包括但不限于可能产生的违约责任、损害赔偿责任及履约义务，同时本公司仍可保存您注销前的相关信息。</a>
                </p>
                <p><a class="adecoration bold dark">（3）一旦注销成功，账户记录、账户功能等将无法恢复或提供。</a></p>
                <p><a
                  class="adecoration bold dark">8、如您自开立京东钱包账户之日起6个月内无主动交易，则向您重新核实身份之前，本公司将有权暂停向您提供京东钱包服务或者注销该京东钱包账户。</a>
                </p>
                <p><a class="bold">五、 使用京东钱包服务的注意事项</a></p>
                <p>为有效保障您使用京东钱包服务时的合法权益，本公司提醒您注意以下事项：</p>
                <p>（一） 身份验证</p>
                <p>1、您在注册、使用京东钱包服务的过程中，请您提供合法、真实、有效及完整的资料（包括但不限于身份证、、护照、营业执照、开户许可证等证明、联系方式、从事职业、通讯地址）。<a
                  class="adecoration bold dark">为了能将账户资金变动及时通知到您，以及更好保障您的账户安全，如该等资料发生变更，请您及时通知本公司。
                  为了及时有效地验证您的信息（包括但不限于身份信息、账户信息、购汇额度），根据法律法规及监管规定或本公司为你提供更好服务所需，您同意我们可以把您的信息提供给合法第三方根据第三方的信息反馈进行验证。您应确保京东钱包登录名、会员号或账户绑定的电子邮箱或手机号均为您本人持有，如您占用了他人的电子邮箱或手机号的，为避免给电子邮箱或手机号持有人带来不便或不利影响，也为了您的资金安全，本公司可能将该邮箱或手机号从您的会员号或账户中删除并解除关联。</a>
                </p>
                <p><a class="adecoration bold dark">2、若您为个人用户，在出现下列情形时，请您积极配合本公司核对您的有效身份证件或其他必要文件，留存有效身份证件的彩色扫描件，且完成本公司要求的相关身份验证： </a>
                </p>
                <p><a class="adecoration bold dark">(1)您办理充值、收取或支付单笔金额人民币1万元以上或者外币等值1000美元以上业务的； </a></p>
                <p><a class="adecoration bold dark">（2）您名下全部京东钱包账户项下30天内充值、收取及支付总金额累计人民币5 万元以上或外币等值1万美元以上的；</a></p>
                <p><a class="adecoration bold dark">（3）您名下全部京东钱包账户余额连续10天超过人民币5000元或外币等值1000美元的； </a></p>
                <p><a class="adecoration bold dark">（4）您使用京东钱包服务买卖金融产品或服务的；</a></p>
                <p><a class="adecoration bold dark">（5）您一次性购买不记名预付卡超过人民币1万元，或通过不记名预付卡为京东钱包账户累计充值超过人民币 1万元的；</a></p>
                <p><a class="adecoration bold dark">（6）您要求变更身份信息或您身份信息已过有效期的；</a></p>
                <p><a class="adecoration bold dark">（7）本公司认为您的交易行为或交易情况出现异常的；</a></p>
                <p><a class="adecoration bold dark">（8）本公司认为您的身份信息或相关资料存在疑点或本公司在向您提供服务的过程中认为您已经提供的身份信 息或相关资料存在疑点的；</a>
                </p>
                <p><a class="adecoration bold dark">（9）本公司认为应核对或留存您身份证件或其他必要文件的其他情形的。 </a></p>
                <p><a class="adecoration bold dark">本条款所称“以上”,包括本数。 </a></p>
                <p><a class="adecoration bold dark">3、为了满足相关监管规定的要求，您同意按照本公司的要求及通知的时间提供您的身份信息以完成身份验证，否则您可能无法进行收款、提现、余额支付、购买理财产品等操作，且本公司可能对您的账户余额进行止付或注销您的账户。 </a>
                </p>
                <p><a class="adecoration bold dark">(二)
                  存在如下情形时，本公司会对您名下会员号或/及京东钱包账户暂停或终止提供京东钱包服务，或对余额进行止付，且有权限制您所使用的产品或服务功能（包括但不限于对会员号或/及账户名下的款项和在途交易采取止付、取消交易、调账等限制措施：</a>
                </p>
                <p><a class="adecoration bold dark">（1）您违反了本协议的约定；</a></p>
                <p><a class="adecoration bold dark">（2）根据法律法规及法律文书的规定；</a></p>
                <p><a class="adecoration bold dark">（3）根据有权机关的要求；</a></p>
                <p><a class="adecoration bold dark">（4）您的会员号或账户操作、资金流向等存在异常时或您的会员号或账户可能产生风险的；</a></p>
                <p><a class="adecoration bold dark">（5）您在参加市场活动时有批量注册京东钱包会员号或账户、刷信用、交易内容不符或作弊等违反活动规则、 违反诚实信用原则的；</a></p>
                <p><a class="adecoration bold dark">（6）他人向您京东钱包账户错误汇入资金等导致您可能存在不当获利的；</a></p>
                <p><a class="adecoration bold dark">（7）您遭到他人投诉，且对方已经提供了一定证据的；</a></p>
                <p><a class="adecoration bold dark">（8）您可能错误地操作他人京东钱包会员号或账户，或者将他人会员号或账户进行了身份验证的。</a></p>
                <p><a class="adecoration bold dark">除（2）、（3）规定的情形外，如您申请恢复服务、解除上述止付或限制，请您向我们提供相关资料及身份证明等文件，以便本公司进行核实。</a>
                </p>
                <p><a class="bold">（三） 京东钱包服务规则 </a></p>
                <p>1、为了您能获得良好的支付体验，您理解并认可，本公司可根据您的支付习惯或本公司推荐的设置向您提供京东钱包服务，如根据您的支付习惯进行支付渠道的排序。</p>
                <p><a class="adecoration bold dark">2、您使用扫码方式或使用其他本公司支持的付款方式进行支付时，您无需输入密码即可在一定额度内完成支付，本公司会按照商家确定的金额从您的资产（扣款渠道视情况而定）里扣款给商家；同时，如您是在中国大陆以外的地区购物，为了方便您退税，本公司需要把您会员号或账户的绑定手机号码同步给相关商家，以便商家协助您退税。</a>
                </p>
                <p><a class="adecoration bold dark">3、京东钱包服务中您可使用的收付款额度，日累计转账限额和笔数，可能因您使用该支付服务时所处的国家/地区、监管要求、支付场景、银行额度控制、本公司风险控制、身份要素验证等事由而有不同，具体额度请见本网站页面提示或公告。</a>
                </p>
                <p><a class="adecoration bold dark">4、您认可京东钱包会员号或账户的使用记录、交易数据等均以本公司系统记录为准。如您对该等数据存有异议的，可及时向本公司提出异议，并提供相关证据供本公司核实。</a>
                </p>
                <p><a class="adecoration bold dark">5、如您使用京东钱包代扣服务的，下面任一情况下均会导致扣款不成功：</a></p>
                <p><a class="adecoration bold dark">（1）您指定的账户余额不足；</a></p>
                <p><a class="adecoration bold dark">（2）您指定的会员号或账户已被采取止付、冻结或其他限制使用权限的措施；</a></p>
                <p><a class="adecoration bold dark">（3）超出监管部门、本公司或银行规定的付款额度。</a></p>
                <p>6、您在使用京东钱包服务过程中，本协议内容、网页上出现的关于操作的提示或本公司发送到手机的信息内容构成您使用京东钱包服务的相关规则。</p>
                <p><a class="adecoration bold dark">7、本公司会以网站公告、电子邮件、发送短信、电话、站内信或客户端通知等方式向您发送通知，例如通知您交易进展情况，或者提示您进行相关操作，请您及时予以关注。</a>
                </p>
                <p><a class="adecoration bold dark">8、您应自行承担您使用京东钱包服务期间的货币贬值、汇率波动及收益损失等风险，您仅在京东钱包代收代付款项（不含被冻结、止付或其他限制的款项）的金额范围内享有对该等款项支付、提现的权利。</a>
                </p>
                <p><a class="adecoration bold dark">9、服务咨询及投诉</a></p>
                <p><a class="adecoration bold dark">如您使用本公司的服务过程中遇到问题，您可以通过拨打95118或者本公司公布的其他方式等方式联系我们。如您被他人投诉或投诉他人，本公司有权将您的主体信息、联系方式、投诉相关的内容等必要信息提供给争议向对方或相关部门，以便及时解决投诉纠纷，以保护您及他人的合法权益；但法律法规另有规定的除外。</a>
                </p>
                <p><a class="bold">（四） 京东钱包服务的承诺和声明 </a></p>
                <p>1、本公司并非银行，本协议项下涉及的资金转移均通过银行来实现，您接受资金在转移途中产生的合理时间。</p>
                <p><a class="adecoration bold dark">2、您理解，基于相关法律法规，对本协议项下的任何服务，本公司均不提供任何担保、垫资。</a></p>
                <p>3、本公司会将您委托本公司代收或代付的款项，严格按照法律法规或有权机关的监管要求进行管理。</p>
                <p><a class="adecoration bold dark">4、本公司提示您注意，京东钱包账户所记录的资金余额不同于您本人的银行存款，不受《存款保险条例》保护，其实质为您委托本公司保管的、所有权归属于您的预付价值。该预付价值对应的货币资金虽然属于您，但不以您本人名义存放在银行，而是以本公司名义存放在银行，并且由本公司向银行发起资金调拨指令。</a>
                </p>
                <p>5、根据《非银行支付机构网络支付业务管理办法》规定，本公司不得为金融机构，以及从事信贷、融资、理财、担保、信托、货币兑换等金融业务的其他机构开立支付账户。</p>
                <p><a class="bold">（五） 交易风险提示 </a></p>
                <p>1、在使用京东钱包服务时，若您或您的交易对方未遵从本协议或相关网站说明、交易、支付页面中之操作提示、规则，则本公司有权拒绝为您与交易对方提供服务，且本公司不承担损害赔偿责任。<a
                  class="adecoration bold dark">若发生前述情形，而款项已先行入账您的京东钱包账户，您同意本公司有权直接自相关账户中扣回相应款项及（或）禁止您要求支付此笔款项之权利。</a>
                </p>
                <p><a class="adecoration bold dark">2、您使用京东钱包服务购买金融类产品时，为了您的利益，建议您仔细阅读金融类产品的协议以及页面提示，确认销售机构及产品信息，谨慎评估风险后再购买。</a>
                </p>
                <p><a class="bold">（六） 服务费用</a></p>
                <p><a class="adecoration bold dark">在您使用京东钱包服务时，本公司有权向您收取服务费用。本公司拥有制订及调整服务费之权利，具体服务费用以您使用京东钱包服务时本网站或产品页面上所列之收费方式公告或您与本公司达成的其他书面协议为准。除非另有说明或约定，您同意本公司有权自您委托本公司代收或代付的款项或您任一京东钱包账户余额或者其他资产中直接扣除上述服务费用。</a>
                </p>
                <p><a class="bold">（七） 积分</a></p>
                <p>1、就您使用京东钱包服务过程中本公司向您授予的积分，无论该积分以何种方式获得，您都不得使用该积分换取任何现金或金钱</p>
                <p><a class="adecoration bold dark">2、积分并非您拥有所有权的财产，本公司有权单方面调整积分数值或调整本公司的积分规则。</a></p>
                <p>3、您仅有权按本公司的积分规则，将所获积分交换本公司提供的指定的服务或产品。</p>
                <p><a class="adecoration bold dark">4、如本公司有合理理由怀疑您的积分的获得及（或）使用存有欺诈、滥用或其它本公司认为不当的行为，本公司可随时取消、限制或终止您的积分或积分使用。</a>
                </p>
                <p><a class="bold">六、 信息收集、使用、共享</a></p>
                <p><a class="bold">（一） 信息搜集</a></p>
                <p><a
                  class="adecoration bold dark">为更好地向您提供京东钱包服务，除您在申请或使用京东钱包服务时主动向本公司提供的信息外，您同意并授权本公司通过以下途径获取您的信息：</a>
                </p>
                <p><a class="adecoration bold dark">1、收集您留存在本公司的关联公司和（或）京东集团旗下公司处与京东钱包服务相关的信息；</a></p>
                <p><a
                  class="adecoration bold dark">2、向征信机构、资信评估机构或有关法律、监管机构许可的相关机构（以下统称“征信机构”）查询、核实、打印、留存您的信息和（或）信用报告；</a>
                </p>
                <p><a class="adecoration bold dark">3、向行政机关、司法机关查询、打印、留存与任何京东钱包服务相关的信息；</a></p>
                <p><a class="adecoration bold dark">（二） 向合法留存您信息的自然人、法人以及其他组织收集与任何京东钱包服务相关的信息。信息类型
                  您同意并授权本公司收集的您的信息包括但不限于：</a></p>
                <p><a class="adecoration bold dark">1、您的身份信息，包括但不限于姓名/名称、证件号码、证件类型、住所地、电话号码、京东钱包账户认证信息、电子邮箱地址、人脸信息及其他身份信息；</a>
                </p>
                <p><a class="adecoration bold dark">2、您访问本公司网站及其相关网站、或京东钱包移动设备客户端时，或使用京东钱包服务时的操作日志，包括但不限于您的计算机IP地址、设备标识符、硬件型号、操作系统版本、您的位置以及与京东钱包服务相关的日志信息；</a>
                </p>
                <p><a class="adecoration bold dark">3、您在申请、使用本公司提供的服务时所提供、形成的任何数据和信息，包括但不限于您及您提供的关联方的数据和信息；</a></p>
                <p><a class="adecoration bold dark">4、您在本公司的关联公司、京东集团旗下公司和合作伙伴处留存以及形成的与提供京东钱包服务的相关信息及您在本公司的关联公司（或）京东集团旗下公司网站及移动客户端的行为数据；</a>
                </p>
                <p><a class="adecoration bold dark">5、您的信用信息，包括但不限于您的征信记录和信用报告；</a></p>
                <p><a
                  class="adecoration bold dark">6、您的财产信息，包括但不限于您的企业经营状况、财税信息、房产信息、车辆信息、基金、保险、股票、信托、债券等投资理财信息和负债信息等；</a>
                </p>
                <p><a class="adecoration bold dark">7、您在行政机关、司法机关留存的任何信息，包括但不限于户籍信息、您作为法定代表人或实际控制人的企业工商信息、诉讼信息、执行信息和违法犯罪信息等；</a>
                </p>
                <p><a class="adecoration bold dark">8、与京东钱包服务相关的、您留存在其他自然人、法人和组织的其他相关信息。</a></p>
                <p><a class="bold">（三） 信息使用</a></p>
                <p><a class="adecoration bold dark">为更好地向您提供京东钱包服务，您同意并授权本公司将您的信息用于如下用途：</a></p>
                <p><a class="adecoration bold dark">1、创建数据分析模型，为您提供适合于您的服务，并维护、改进这些服务；</a></p>
                <p><a class="adecoration bold dark">2、为您提供京东钱包服务进行必要的调查等；</a></p>
                <p><a class="adecoration bold dark">3、比较信息的准确性并与第三方进行验证，比如验证您的身份信息等；</a></p>
                <p><a class="adecoration bold dark">4、合理评估您的经营状况，防控风险；</a></p>
                <p><a class="adecoration bold dark">5、为使您知晓京东钱包服务并能够及时了解本公司提供的其他服务，通过电子邮件、京东平台/本公司公司站内信、客户端通知、手机短信和（或）传真等方式向您发送服务通知及营销信息。；</a>
                </p>
                <p><a class="adecoration bold dark">6、预防或阻止非法的活动；</a></p>
                <p><a class="adecoration bold dark">7、保护您的账户安全；</a></p>
                <p><a class="adecoration bold dark">8、经您许可的其他用途。</a></p>
                <p><a class="bold">（四） 信息分享</a></p>
                <p><a class="adecoration bold dark">本公司根据法律法规及监管规定对您的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息。您同意并授权本公司在下列任一情况下将您的信息与第三方共享：</a>
                </p>
                <p><a class="adecoration bold dark">1、为了向您提供或推荐本公司的关联公司和（或）京东集团的服务和/或产品的需要，将您的信息提供给本公司的关联公司使用；</a></p>
                <p><a class="adecoration bold dark">2、某些服务和/或产品和/或推广活动由本公司的合作伙伴提供或本公司与合作伙伴共同提供，本公司会与其共享并使用您的相关信息；</a>
                </p>
                <p><a class="adecoration bold dark">3、根据国家相关规定及要求向征信机构发送您的信息；</a></p>
                <p><a class="adecoration bold dark">4、您同意本公司根据有关监管规定，将与本协议有关的信息和您其他相关信息向监管部门、行业自律组织和监管信息系统报送，供监管部门使用和您授权查询使用；</a>
                </p>
                <p><a class="adecoration bold dark">5、根据法律法规的规定及有权机关的要求；</a></p>
                <p><a class="adecoration bold dark">6、获得您的同意或授权的其他情形。</a></p>
                <p><a class="adecoration bold dark">我们在您使用我们的产品与/或服务时如何收集、使用、保存、共享和转让这些信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式，请在京东网站阅读《京东金融隐私政策》，《京东金融隐私政策》为本协议的组成部分。</a>
                </p>
                <p><a class="bold">我们在您使用我们的产品与/或服务时如何收集、使用、保存、共享和转让这些信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式，请在京东网站阅读《京东金融隐私政策》，《京东金融隐私政策》为本协议的组成部分。</a>
                </p>
                <p>
                  1、您应遵守中华人民共和国相关法律法规及您所属、所居住或开展经营活动或其他业务的国家或地区的法律法规，不得将京东钱包服务用于任何非法目的（包括用于禁止或限制交易物品的交易），也不得以任何非法方式使用京东钱包服务。</p>
                <p><a class="adecoration bold dark">2、您不得利用京东钱包服务从事侵害他人合法权益之行为，
                  否则本公司有权进行调查、延迟结算或拒绝提供京东钱包服务，且您应承担所有相关法律责任，因此导致本公司或本公司雇员或其他方受损的，您应承担赔偿责任。</a></p>
                <p>3、上述1和2适用的情况包括但不限于：</p>
                <p>（1）侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。</p>
                <p>（2）违反依法定或约定之保密义务。</p>
                <p>（3）冒用他人名义使用京东钱包服务。</p>
                <p>（4）从事不法交易行为， 如洗钱、恐怖融资、贩卖枪支、毒品、禁药、盗版软件、黄色淫秽物品、其他本公 司认为不得使用京东钱包服务进行交易的物品等。</p>
                <p>（5）提供赌博资讯或以任何方式引诱他人参与赌博。</p>
                <p>（6）未经授权使用他人银行卡， 或利用信用卡、“白条”等金融产品套取现金（以下简称套现）。</p>
                <p>（7）进行与您或交易对方宣称的交易内容不符的交易， 或不真实的交易。</p>
                <p>（8）从事任何可能侵害京东钱包服务系统、数据之行为。</p>
                <p>4、您理解，京东钱包服务有赖于系统的准确运行及操作。若出现系统差错、故障或其他原因引发的展示错误、您或本公司不当获利等情形，您同意本公司可以采取更正差错、扣划款项等适当纠正措施。</p>
                <p>
                  5、您不得对京东钱包系统和程序采取反向工程手段进行破解，不得对上述系统和程序（包括但不限于源程序、目标程序、技术文档、客户端至服务器端的数据、服务器数据）进行复制、修改、编译、整合或篡改，不得修改或增减京东钱包系统的任何功能。</p>
                <p><a class="bold">八、权益保障及隐私保护</a></p>
                <p><a class="bold">1、客户权益保障承诺</a></p>
                <p>本公司一直秉承着“客户为先”的原则，并一直努力为您的权益提供各种保障。</p>
                <p><a class="bold">2、用户资金保障</a></p>
                <p>
                  本公司始终重视保护用户的资金安全，将自有资金和用户资金分开存放，承诺不挪用、占用用户资金。如您在使用京东钱包服务过程中，由于您的京东钱包账户被盗用造成资金损失，经本公司同意，您可授权本公司代表您向相关责任第三方或赔付机构进行追偿。您与本公司公司另有约定的除外。</p>
                <p><a class="bold">3、隐私权保护</a></p>
                <p>本公司重视对用户隐私的保护。关于您的身份资料和其他特定资料依京东金融网页公布并不时更新的隐私政策受到保护与保障。</p>
                <p><a class="bold">九、不可抗力、免责及责任限制</a></p>
                <p><a class="adecoration bold dark">（一）免责条款</a></p>
                <p><a class="adecoration bold dark">因下列原因导致本公司无法正常提供服务，本公司不承担任何责任：</a></p>
                <p><a class="adecoration bold dark">（1）本公司系统停机维护或升级；</a></p>
                <p><a class="adecoration bold dark">（2）因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；</a></p>
                <p><a class="adecoration bold dark">（3）用户的电脑软硬件和通信线路、供电线路出现故障的；</a></p>
                <p><a class="adecoration bold dark">（4）用户操作不当或通过非本公司授权或认可的方式使用京东钱包服务的；</a></p>
                <p><a class="adecoration bold dark">（5）因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行原因
                  、第三方服务瑕疵或政府行为等原因。</a></p>
                <p><a class="adecoration bold dark">尽管有前款约定，本公司将采取合理行动积极促使服务恢复正常。</a></p>
                <p><a class="adecoration bold dark">（二）本公司责任范围及责任限制</a></p>
                <p><a class="adecoration bold dark">1、京东钱包用户信息是由用户本人自行提供的，本公司无法保证该信息之准确、及时和完整。</a></p>
                <p><a class="adecoration bold dark">2、本公司可能同时为您及您的（交易）对手方提供京东钱包服务，您同意对本公司可能存在的该等行为予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张本公司在提供京东钱包服务时存在法律上的瑕疵。</a>
                </p>
                <p><a class="bold">十、协议的完整性</a></p>
                <p>
                  本协议由《京东钱包服务协议》、京东金融网页公布的隐私政策等本网站不时公示的各项规则组成，各项规则有约定，而本协议条款没有约定的，以各项规则约定为准。本协议部分内容被有管辖权的法院认定为违法或无效的，不因此影响其他内容的效力。</p>
                <p><a class="bold">十一、知识产权的保护</a></p>
                <p>
                  1、本公司及关联公司所有系统及本网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由本公司或本公司关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</p>
                <p>2、非经本公司或本公司关联公司书面同意，任何人不得擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。</p>
                <p>3、尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。</p>
                <p><a class="bold">十二、法律适用与管辖</a></p>
                <p><a class="adecoration bold dark">本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由本公司住所地人民法院管辖。</a>
                </p>
              </div>
            </scroller>
          </div>
        </div>
      </div>
      <div class="status-box">
        <span v-for="(item, index) in new Array(statusL)" :class="{active: status == index}"
              @click="status=index"></span>
      </div>
      <button @click="agreeProtocol" :class="{disabled: timer}">{{timer? btnMsg+'s':btnMsg}}</button>
    </div>
    <div class="mask"></div>
  </div>
</template>
<style lang="less" scoped>
  @import "../../assets/css/common";

  .adecoration {
    text-decoration: underline
  }

  .bold {
    font-weight: 700
  }

  .dark {
    color: #666666;
  }

  .protocol-scroller--wrapper {
    position: absolute;
    top: 46px;
    bottom: 101px;
    left: 28px;
    right: 28px;
    overflow: hidden;
  }

  .protocol-scroller-box {
    .transition-3s;
    white-space: nowrap;
    height: 100%;
    &.status0 {
      .transform(translate(0, 0))
    }
    &.status1 {
      .transform(translate(-100%, 0))
    }
    &.status2 {
      .transform(translate(-200%, 0))
    }
    > div {
      width: 100%;
      height: 100%;
      display: inline-block;
    }
  }

  .protocol-box {
    .status-box {
      width: 80px;
      height: 3px;
      position: absolute;
      left: 0;
      right: 0;
      margin: auto;
      bottom: 86px;
      > span {
        width: 20px;
        height: 3px;
        margin-left: 10px;
        border-radius: 3px;
        cursor: pointer;
        background: #ccc;
        float: left;
        &.active {
          background: #FCAD57;
        }
        &:first-child {
          margin-left: 0;
        }
      }
    }
    .pro-title {
      line-height: 20px;
      font-size: 13px;
      color: #9DAEB9;
      padding: 10px 0;
      &.active {
        > span {
          .transform(rotate(270deg));
          .transition-3s
        }
      }
      > span {
        margin: 4px 10px 0 0;
      }
    }
    > button {
      position: absolute;
      bottom: 29px;
      left: 0;
      right: 0;
      margin: auto;
      width: 271px;
      height: 46px;
      font-size: 16px;
      border-radius: 23px;
      background: #FCAD57;
      color: #fff;
      &.disabled {
        background: #ddd;
      }
    }
    .protocol-content {
      line-height: 20px;
      font-size: 12px;
      color: #9DAEB9;
      white-space: pre-wrap;
    }
    .close-btn {
      position: absolute;
      top: 10px;
      right: 10px;
      width: 24px;
      height: 24px;
      background: url('../../assets/img/pop-close.png');
    }
    > p {
      text-align: center;
      font-size: 14px;
      line-height: 22px;
      margin: 13px 0 13px;
      color: #788A96;
    }
    position: absolute;
    top: 109px;
    bottom: 109px;
    left: 30px;
    right: 30px;
    background: #fff;
    z-index: 10;
    border-radius: 10px;
  }
</style>
<script>
  export default {
    props: ['value'],
    data() {
      return {
        btnMsg: 3,
        status: 0,
        statusL: 3,
        timer: null,
        obj: null,
        eObj: null,
        touchStart: null,
        touchEnd: null
      }
    },
    watch: {
      'value': function (v) {
        if (!v) {
          clearInterval(this.timer)
          this.timer = null
          this.btnMsg = 3
          this.obj.removeEventListener(this.touchStart, this.startHandler)
          this.obj.removeEventListener(this.touchEnd, this.endHandler)
        } else {
          this.timer = setInterval(() => {
            if (!--this.btnMsg) {
              clearInterval(this.timer)
              this.status++
              this.timer = null
              this.btnMsg = '同意协议'
            }
          }, 1000)
          this.$nextTick(() => {
            this.obj = document.getElementById('protocol-scroller--wrapper')
            this.obj.addEventListener(this.touchStart, this.startHandler)
            this.obj.addEventListener(this.touchEnd, this.endHandler)
          })
        }
      }
    },
    mounted() {
      var isTouchSupported = !!('ontouchstart' in window)
      this.touchStart = isTouchSupported ? "touchstart" : "mousedown"
      this.touchEnd = isTouchSupported ? "touchend" : "mouseup"
    },
    methods: {
      startHandler(e) {
        this.eObj = e
      },
      endHandler(e) {
        if (e.changedTouches) {
          if (e.changedTouches[0].pageX - this.eObj.changedTouches[0].pageX > 10) this.swipeLeft()
          else if (e.changedTouches[0].pageX - this.eObj.changedTouches[0].pageX < -10) this.swipeRight()
        } else {
          if (e.pageX - this.eObj.pageX > 10) this.swipeLeft()
          else if (e.pageX - this.eObj.pageX < -10) this.swipeRight()
        }
      },
      swipeLeft() {
        if (this.status) this.status--
      },
      swipeRight() {
        if (this.status < this.statusL - 1) this.status++
      },
      agreeProtocol(e) {
        if (this.btnMsg == "同意协议") {
          this.$emit('agree', {
            showConfirmBtn: true
          })
        } else {
          return
        }
      }
    },
    beforeDestroy() {
      this.$el && this.$el.parentNode.removeChild(this.$el)
      this.obj.removeEventListener(this.touchStart, this.startHandler)
      this.obj.removeEventListener(this.touchEnd, this.endHandler)
    },
    components: {}
  }
</script>
